
const GRAPH = {
    "Алайский": { "Аэропорт": 11, "Ленинский": 12, "Центральный": 9, "Джал": 14, "Темир": 10 },
    "Аэропорт": { "Алайский": 11, "Ленинский": 10, "Центральный": 7, "Джал": 10, "Ак-Бура": 14 },
    "Ленинский": { "Алайский": 12, "Аэропорт": 10, "Центральный": 5, "Джал": 8, "Ак-Бура": 11, "Мамайка": 15 },
    "Центральный": { "Алайский": 9, "Аэропорт": 7, "Ленинский": 5, "Джал": 8, "Темир": 12, "Мамайка": 13 },
    "Джал": { "Алайский": 14, "Аэропорт": 10, "Ленинский": 8, "Центральный": 8, "Темир": 9, "Ак-Бура": 15 },
    "Темир": { "Алайский": 10, "Джал": 9, "Центральный": 12, "Мамайка": 11 },
    "Ак-Бура": { "Аэропорт": 14, "Ленинский": 11, "Джал": 15 },
    "Мамайка": { "Ленинский": 15, "Центральный": 13, "Темир": 11 }
};


function routeSetting(a, b, ...routes) {

}

function test(a, b, ...routes) {
    console.time()
    routeSetting(a, b, ...routes)
    console.timeEnd()
}

test()